IDENTIFICATION DIVISION.
PROGRAM-ID. 'LINE BY LINE'.


ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
	SELECT dyn-file ASSIGN TO filename
	ORGANIZATION IS LINE SEQUENTIAL. 
	


DATA DIVISION.
FILE SECTION.
FD  dyn-file.
01 line-record PIC X(300).


WORKING-STORAGE SECTION.
01 filename 	PIC 	X(100).
01 EOF		PIC	X	VALUE 'N'.


PROCEDURE DIVISION.
	ACCEPT filename.
	OPEN INPUT dyn-file.
	PERFORM UNTIL EOF = 'Y'
		READ dyn-file INTO line-record
		AT END MOVE 'Y' TO EOF
		NOT AT END DISPLAY line-record
	END-PERFORM.
	CLOSE dyn-file.
	STOP-RUN.


