IDENTIFICATION DIVISION.
PROGRAM-ID.	SEQUENZ.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 	ST	PIC 	  999.
01	EN	PIC	    999.
01	COUNTER PIC	999.

PROCEDURE DIVISION.

DISPLAY "Start: " WITH NO ADVANCING. ACCEPT ST.
DISPLAY "End  : " WITH NO ADVANCING. ACCEPT EN.

PERFORM VARYING COUNTER FROM ST BY 1 UNTIL COUNTER > EN
	DISPLAY COUNTER
END-PERFORM.
