IDENTIFICATION DIVISION.
PROGRAM-ID.	SUM.

DATA DIVISION.
WORKING-STORAGE SECTION.
	01 WS-A 	PIC 99.
	01 WS-B 	PIC 99.
	01 WS-SUM 	PIC 99.

PROCEDURE DIVISION.

GET-NUMBERS.
	DISPLAY "1. number: " WITH NO ADVANCING. ACCEPT WS-A.
	DISPLAY "2. number: " WITH NO ADVANCING. ACCEPT WS-B.

CALCULATE.
	COMPUTE WS-SUM = WS-A + WS-B.

SHOW-RESULT.
	DISPLAY "The result is : " WS-SUM.
