IDENTIFICATION 	DIVISION.
PROGRAM-ID. 'VOLKSBANK-PARSER'.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
	SELECT INPUT-FILE ASSIGN TO FILENAME
	ORGANIZATION IS LINE SEQUENTIAL.
	
	

DATA DIVISION.
FILE SECTION.
FD INPUT-FILE.
01 INPUT-RECORD.
	05 col-record occurs 19 times pic x(100).
	


WORKING-STORAGE SECTION.
01 FILENAME	PIC	X(100).
01 EOF		PIC	X VALUE 'N'.
01 DATENSATZ.
	05 BEZ_AUFTRAGSKONTO	 	PIC 	X(100).
	05 IBAN_AUFTRAGSKONTO 		PIC 	X(100).
	05 BIC_AUFTRAGSKONTO 		PIC 	X(100).
	05 BANK_NAME_AUFTRAGSKONTO 	PIC 	X(100).
	05 BUCHUNGSTAG			PIC 	X(100).
	05 VALUTADATUM 			PIC 	X(100).
	05 NAME_ZAHLUNGSBETEILIGTER 	PIC 	X(100).
	05 IBAN_ZAHLUNGSBETEILIGTER 	PIC 	X(100).
	05 BIC_ZAHLUNGSBETEILIGTER 	PIC 	X(100).
	05 BUCHUNGSTEXT			PIC 	X(100).
	05 VERWENDUNGSZWECK 		PIC 	X(100).
	05 BETRAG 			PIC 	X(100).
	05 WÄHRUNG 			PIC 	9(10)V99.
	05 SALDO_NACH_BUCHUNG 		PIC 	X(100).
	05 BEMERKUNG 			PIC 	X(100).
	05 KATEGORIE 			PIC 	X(100).
	05 STEUERRELEVANT 		PIC 	X(100).
	05 GLÄUBIGERID 			PIC 	X(100).
	05 MANDATSREFERENZ 		PIC 	X(100).


	
  

PROCEDURE DIVISION.
	accept filename.
	OPEN INPUT INPUT-FILE.
	READ INPUT-FILE INTO INPUT-RECORD.
	PERFORM UNTIL EOF = 'Y'
		READ INPUT-FILE INTO INPUT-RECORD
		AT END 
			MOVE 'Y' TO EOF
		NOT AT END 
			UNSTRING INPUT-RECORD DELIMITED BY ';' INTO input-record
			inspect col-record(12) replacing all ',' by '.'
			move input-record to datensatz
	END-PERFORM.
	CLOSE INPUT-FILE.

	END-RUN.
